In [34]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th
{
    border: 1px solid black !important;
}
</style>

In [35]:
import pandas as pd
df = pd.DataFrame({
    "name": ["Sudhir", "Pavir", "Kathy", "Peter"],
    "nationality": ["India", "India", "USA", "USA"],
    "gender": ["male", "male", "female", "male"],
    "handedness": ["left", "right", "right", "right"],
    "age": [10,20,30,40]
})
df

     name nationality  gender handedness  age
0  Sudhir       India    male       left   10
1   Pavir       India    male      right   20
2   Kathy         USA  female      right   30
3   Peter         USA    male      right   40

In [36]:
pd.crosstab(df.nationality, df.gender)

gender       female  male
nationality
India             0     2
USA               1     1

In [37]:
pd.crosstab(df.nationality, df.gender, margins=True)

gender       female  male  All
nationality
India             0     2    2
USA               1     1    2
All               1     3    4

In [38]:
pd.crosstab(df.nationality, df.gender, normalize="index")

gender       female  male
nationality
India           0.0   1.0
USA             0.5   0.5

In [39]:
pd.crosstab(df.nationality, df.gender, normalize="columns")

gender       female      male
nationality
India           0.0  0.666667
USA             1.0  0.333333

In [40]:
pd.crosstab(df.gender, [df.handedness, df.nationality], margins=True)

handedness   left right     All
nationality India India USA
gender
female          0     0   1   1
male            1     1   1   3
All             1     1   2   4

In [41]:
pd.crosstab([df.gender,df.handedness], df.nationality)

nationality        India  USA
gender handedness
female right           0    1
male   left            1    0
       right           1    1

In [42]:
pd.crosstab(df.nationality, df.gender)

gender       female  male
nationality
India             0     2
USA               1     1

In [43]:
import numpy as np
pd.crosstab(df.nationality, df.gender, values=df.age, aggfunc=np.average)

gender       female  male
nationality
India           NaN  15.0
USA            30.0  40.0